# CorrectionFactor Properties

---
The CorrectionFactor type exposes the following members.
| Name| Description
---|---|---
| Factor|  Get factor value of wire correction factor.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
#### Reference
CorrectionFactor Class
Autodesk.Revit.DB.Electrical Namespace